{
  "GET /api": {
    "description": "serves up a json representation of all the available endpoints of the api"
  },
  "GET /api/topics": {
    "description": "serves an array of all topics",
    "queries": [],
    "exampleResponse": {
      "topics": [{ "slug": "football", "description": "Footie!" }]
    }
  },
  "GET /api/articles": {
    "description": "serves an array of all topics",
    "queries": ["title", "article_id", "topic", "votes", "comment_count", "created_at", "author"],
    "exampleResponse": {
      "articles": [
        {
          "article_id": 34,
          "title": "The Notorious MSG’s Unlikely Formula For Success",
          "body": "The 'umami' craze has turned a much-maligned and misunderstood food additive into an object of obsession for the world’s most innovative chefs. But secret ingredient monosodium glutamate’s biggest secret may be that there was never anything wrong with it at all.",
          "votes": 0,
          "topic": "cooking",
          "author": "grumpy19",
          "created_at": "2020-11-22T11:13:00.000Z",
          "comment_count": "11"
        }
      ]
    }
  },
  "GET /api/articles/:article_id": {
    "description": "serves an article with the specified article_id",
    "exampleResponse": {
      "articles": [
        {
          "article_id": 4,
          "title": "Making sense of Redux",
          "body": "When I first started learning React, I remember reading lots of articles about the different technologies associated with it. In particular, this one article stood out. It mentions how confusing the ecosystem is, and how developers often feel they have to know ALL of the ecosystem before using React. And as someone who’s used React daily for the past 8 months or so, I can definitely say that I’m still barely scratching the surface in terms of understanding how the entire ecosystem works! But my time spent using React has given me some insight into when and why it might be appropriate to use another technology — Redux (a variant of the Flux architecture).",
          "votes": 2656,
          "topic": "coding",
          "author": "jessjelly",
          "created_at": "2020-09-11T20:12:00.000Z",
          "comment_count": 16
        }
      ]
    }
  },
  "GET /api/articles/:article_id/comments": {
    "description": "serves an array of comments with the specified article_id",
    "exampleResponse": {
      "comments": [
        {
          "comment_id": 14,
          "votes": -4,
          "created_at": "2020-08-14T13:09:00.000Z",
          "author": "weegembump",
          "body": "Iure quas est omnis porro. Est in est distinctio sequi consectetur rerum deserunt. Et et reiciendis. Consequatur distinctio sint porro neque molestiae."
        }
      ]
    }
  }
}
